In [37]:

import pandas as pd
data_frame=pd.DataFrame()

In [38]:
type(data_frame)

pandas.core.frame.DataFrame

In [39]:
data=[1,2,3,4,5]
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [40]:
data2=[["sana",26],['eesa',23],['rukhsana',21]]
pd.DataFrame(data2)

          0   1
0      sana  26
1      eesa  23
2  rukhsana  21

In [41]:
data_fram2=pd.DataFrame(data2,columns=["Name","Age"])
data_fram2

       Name  Age
0      sana   26
1      eesa   23
2  rukhsana   21

In [42]:
data3={"Name":["eesa","sana","sameer","ali"],"Age":[27,21,24,52]}
data_frame3=pd.DataFrame(data3)
data_frame3

     Name  Age
0    eesa   27
1    sana   21
2  sameer   24
3     ali   52

In [43]:
import pandas as pd
data4=[{"eesa":26,"fairoz":27},{"sameer":31,"fazan":12}]
data_frame4=pd.DataFrame(data4)
data4
data_frame4["eesa"].dtype

dtype('float64')

In [44]:
data5=[['eesa',26],['sana',28],['fairoz',30],['sameer',30],['Mohammad',45]]
data_frame5=pd.DataFrame(data5,columns=["Name","Age"],index=['first','second','third','fourth','fvth'])
data_frame5

            Name  Age
first       eesa   26
second      sana   28
third     fairoz   30
fourth    sameer   30
fvth    Mohammad   45

In [45]:
import pandas as pd
pd.read_csv('Book1.csv')

      NAME  AGE DESIGNATION SALARY
0     Eesa   26    data eng    70k
1   Fairoz   27      ml eng    80k
2   Sameer   28     nwk eng    50k
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k

In [46]:
pd.read_csv('text1.txt')

  Name\tAge \tDesignation\tSalary
0               eesa\t24\tml\t10k
1               sana\t23\tnt\t20k
2           fathima\t25\tdvp\t30k
3             soiba\t45\teng\t50k
4             sameer\t75\twk\t30k
5            hussain\t80\tjk\t90k

In [47]:
import pandas as pd
df=pd.read_csv('Book1.csv',sep="@")
print(df)

  NAME,AGE,DESIGNATION,SALARY
0        Eesa,26,data eng,70k
1        Fairoz,27,ml eng,80k
2       Sameer,28,nwk eng,50k
3    Hussain,30,developer,90k
4      Mohammd,78,old mng,95k

In [48]:
import json

# Example JSON string
data = '{"name": "John", "age": 30, "city": "New York"}'

# Load the JSON string into a Python dictionary
try:
    parsed_data = json.loads(data)
    print(parsed_data)  # Output: {'name': 'John', 'age': 30, 'city': 'New York'}
except json.JSONDecodeError as e:
    print("Failed to parse JSON:", e)

{'name': 'John', 'age': 30, 'city': 'New York'}

In [49]:
# data="""{"Name":'eesa',
#        "Age":26,
#        "salary":1000,
#        "company_name":"microsoft"}"""
# import json 
# json.loads(data)

In [50]:
# Data cleaning
import pandas as pd
data1=pd.read_csv('Book1.csv')
print(data1)
print
print(data1.shape)
print(data1.dtypes)

      NAME  AGE DESIGNATION SALARY
0     Eesa   26    data eng    70k
1   Fairoz   27      ml eng    80k
2   Sameer   28     nwk eng    50k
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k
(5, 4)
NAME           object
AGE             int64
DESIGNATION    object
SALARY         object
dtype: object

In [51]:
data1.head(2)

     NAME  AGE DESIGNATION SALARY
0    Eesa   26    data eng    70k
1  Fairoz   27      ml eng    80k

In [52]:
print(data1.tail(2))
print(data1.sample(n=3))
# converting data_frame into array
print(data1.values)
print(data1.to_string())

      NAME  AGE DESIGNATION SALARY
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k
     NAME  AGE DESIGNATION SALARY
0    Eesa   26    data eng    70k
2  Sameer   28     nwk eng    50k
1  Fairoz   27      ml eng    80k
[['Eesa' 26 'data eng' '70k']
 ['Fairoz' 27 'ml eng' '80k']
 ['Sameer' 28 'nwk eng' '50k']
 ['Hussain' 30 'developer' '90k']
 ['Mohammd' 78 'old mng' '95k']]
      NAME  AGE DESIGNATION SALARY
0     Eesa   26    data eng    70k
1   Fairoz   27      ml eng    80k
2   Sameer   28     nwk eng    50k
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k

In [53]:
print(data1.size)
print(data1.ndim)

20
2

In [54]:
data1

      NAME  AGE DESIGNATION SALARY
0     Eesa   26    data eng    70k
1   Fairoz   27      ml eng    80k
2   Sameer   28     nwk eng    50k
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k

In [55]:
data1.T

                    0       1        2          3        4
NAME             Eesa  Fairoz   Sameer    Hussain  Mohammd
AGE                26      27       28         30       78
DESIGNATION  data eng  ml eng  nwk eng  developer  old mng
SALARY            70k     80k      50k        90k      95k

In [56]:
data1.empty

False

In [57]:
pd.DataFrame().empty
print(data1.describe)

<bound method NDFrame.describe of       NAME  AGE DESIGNATION SALARY
0     Eesa   26    data eng    70k
1   Fairoz   27      ml eng    80k
2   Sameer   28     nwk eng    50k
3  Hussain   30   developer    90k
4  Mohammd   78     old mng    95k>